GopalSaraf/Practicals/PSDL/include/proc/pic18f85j50.inc
// Register: PMDIN2H
#define PMDIN2H PMDIN2H
PMDIN2H                                  equ 0F45h

// Register: PMDOUT2
#define PMDOUT2 PMDOUT2
PMDOUT2                                  equ 0F46h

// Register: PMDOUT2L
#define PMDOUT2L PMDOUT2L
PMDOUT2L                                 equ 0F46h

// Register: PMDOUT2H
#define PMDOUT2H PMDOUT2H
PMDOUT2H                                 equ 0F47h

// Register: PMMODE
#define PMMODE PMMODE
PMMODE                                   equ 0F48h

// Register: PMMODEL
#define PMMODEL PMMODEL
PMMODEL                                  equ 0F48h
// bitfield definitions
PMMODEL_WAITE_POSN                       equ 0000h
PMMODEL_WAITE_POSITION                   equ 0000h
PMMODEL_WAITE_SIZE                       equ 0002h
PMMODEL_WAITE_LENGTH                     equ 0002h
PMMODEL_WAITE_MASK                       equ 0003h
PMMODEL_WAITM_POSN                       equ 0002h
PMMODEL_WAITM_POSITION                   equ 0002h
PMMODEL_WAITM_SIZE                       equ 0004h
PMMODEL_WAITM_LENGTH                     equ 0004h
PMMODEL_WAITM_MASK                       equ 003Ch
PMMODEL_WAITB_POSN                       equ 0006h
PMMODEL_WAITB_POSITION                   equ 0006h
PMMODEL_WAITB_SIZE                       equ 0002h
PMMODEL_WAITB_LENGTH                     equ 0002h
PMMODEL_WAITB_MASK                       equ 00C0h
PMMODEL_WAITE0_POSN                      equ 0000h
PMMODEL_WAITE0_POSITION                  equ 0000h
PMMODEL_WAITE0_SIZE                      equ 0001h
PMMODEL_WAITE0_LENGTH                    equ 0001h
PMMODEL_WAITE0_MASK                      equ 0001h
PMMODEL_WAITE1_POSN                      equ 0001h
PMMODEL_WAITE1_POSITION                  equ 0001h
PMMODEL_WAITE1_SIZE                      equ 0001h
PMMODEL_WAITE1_LENGTH                    equ 0001h
PMMODEL_WAITE1_MASK                      equ 0002h
PMMODEL_WAITM0_POSN                      equ 0002h
PMMODEL_WAITM0_POSITION                  equ 0002h
PMMODEL_WAITM0_SIZE                      equ 0001h
PMMODEL_WAITM0_LENGTH                    equ 0001h
PMMODEL_WAITM0_MASK                      equ 0004h
PMMODEL_WAITM1_POSN                      equ 0003h
PMMODEL_WAITM1_POSITION                  equ 0003h
PMMODEL_WAITM1_SIZE                      equ 0001h
PMMODEL_WAITM1_LENGTH                    equ 0001h
PMMODEL_WAITM1_MASK                      equ 0008h
PMMODEL_WAITM2_POSN                      equ 0004h
PMMODEL_WAITM2_POSITION                  equ 0004h
PMMODEL_WAITM2_SIZE                      equ 0001h
PMMODEL_WAITM2_LENGTH                    equ 0001h
PMMODEL_WAITM2_MASK                      equ 0010h
PMMODEL_WAITM3_POSN                      equ 0005h
PMMODEL_WAITM3_POSITION                  equ 0005h
PMMODEL_WAITM3_SIZE                      equ 0001h
PMMODEL_WAITM3_LENGTH                    equ 0001h
PMMODEL_WAITM3_MASK                      equ 0020h
PMMODEL_WAITB0_POSN                      equ 0006h
PMMODEL_WAITB0_POSITION                  equ 0006h
PMMODEL_WAITB0_SIZE                      equ 0001h
PMMODEL_WAITB0_LENGTH                    equ 0001h
PMMODEL_WAITB0_MASK                      equ 0040h
PMMODEL_WAITB1_POSN                      equ 0007h
PMMODEL_WAITB1_POSITION                  equ 0007h
PMMODEL_WAITB1_SIZE                      equ 0001h
PMMODEL_WAITB1_LENGTH                    equ 0001h
PMMODEL_WAITB1_MASK                      equ 0080h

// Register: PMMODEH
#define PMMODEH PMMODEH
PMMODEH                                  equ 0F49h
// bitfield definitions
PMMODEH_MODE_POSN                        equ 0000h
PMMODEH_MODE_POSITION                    equ 0000h
PMMODEH_MODE_SIZE                        equ 0002h
PMMODEH_MODE_LENGTH                      equ 0002h
PMMODEH_MODE_MASK                        equ 0003h
PMMODEH_MODE16_POSN                      equ 0002h
PMMODEH_MODE16_POSITION                  equ 0002h
PMMODEH_MODE16_SIZE                      equ 0001h
PMMODEH_MODE16_LENGTH                    equ 0001h
PMMODEH_MODE16_MASK                      equ 0004h
PMMODEH_INCM_POSN                        equ 0003h
PMMODEH_INCM_POSITION                    equ 0003h
PMMODEH_INCM_SIZE                        equ 0002h
PMMODEH_INCM_LENGTH                      equ 0002h
PMMODEH_INCM_MASK                        equ 0018h
PMMODEH_IRQM_POSN                        equ 0005h
PMMODEH_IRQM_POSITION                    equ 0005h
PMMODEH_IRQM_SIZE                        equ 0002h
PMMODEH_IRQM_LENGTH                      equ 0002h
PMMODEH_IRQM_MASK                        equ 0060h
PMMODEH_BUSY_POSN                        equ 0007h
PMMODEH_BUSY_POSITION                    equ 0007h
PMMODEH_BUSY_SIZE                        equ 0001h
PMMODEH_BUSY_LENGTH                      equ 0001h
PMMODEH_BUSY_MASK                        equ 0080h
PMMODEH_MODE0_POSN                       equ 0000h
PMMODEH_MODE0_POSITION                   equ 0000h
PMMODEH_MODE0_SIZE                       equ 0001h
PMMODEH_MODE0_LENGTH                     equ 0001h
PMMODEH_MODE0_MASK                       equ 0001h
PMMODEH_MODE1_POSN                       equ 0001h
PMMODEH_MODE1_POSITION                   equ 0001h
PMMODEH_MODE1_SIZE                       equ 0001h
PMMODEH_MODE1_LENGTH                     equ 0001h
PMMODEH_MODE1_MASK                       equ 0002h
PMMODEH_INCM0_POSN                       equ 0003h
PMMODEH_INCM0_POSITION                   equ 0003h
PMMODEH_INCM0_SIZE                       equ 0001h
PMMODEH_INCM0_LENGTH                     equ 0001h
PMMODEH_INCM0_MASK                       equ 0008h
PMMODEH_INCM1_POSN                       equ 0004h
PMMODEH_INCM1_POSITION                   equ 0004h
PMMODEH_INCM1_SIZE                       equ 0001h
PMMODEH_INCM1_LENGTH                     equ 0001h
PMMODEH_INCM1_MASK                       equ 0010h
PMMODEH_IRQM0_POSN                       equ 0005h
PMMODEH_IRQM0_POSITION                   equ 0005h
PMMODEH_IRQM0_SIZE                       equ 0001h
PMMODEH_IRQM0_LENGTH                     equ 0001h
PMMODEH_IRQM0_MASK                       equ 0020h
PMMODEH_IRQM1_POSN                       equ 0006h
PMMODEH_IRQM1_POSITION                   equ 0006h
PMMODEH_IRQM1_SIZE                       equ 0001h
PMMODEH_IRQM1_LENGTH                     equ 0001h
PMMODEH_IRQM1_MASK                       equ 0040h

