GopalSaraf/Practicals/PSDL/include/proc/pic18f85j50.inc
// Register: PORTF
#define PORTF PORTF
PORTF                                    equ 0F85h
// bitfield definitions
PORTF_RF2_POSN                           equ 0002h
PORTF_RF2_POSITION                       equ 0002h
PORTF_RF2_SIZE                           equ 0001h
PORTF_RF2_LENGTH                         equ 0001h
PORTF_RF2_MASK                           equ 0004h
PORTF_RF3_POSN                           equ 0003h
PORTF_RF3_POSITION                       equ 0003h
PORTF_RF3_SIZE                           equ 0001h
PORTF_RF3_LENGTH                         equ 0001h
PORTF_RF3_MASK                           equ 0008h
PORTF_RF4_POSN                           equ 0004h
PORTF_RF4_POSITION                       equ 0004h
PORTF_RF4_SIZE                           equ 0001h
PORTF_RF4_LENGTH                         equ 0001h
PORTF_RF4_MASK                           equ 0010h
PORTF_RF5_POSN                           equ 0005h
PORTF_RF5_POSITION                       equ 0005h
PORTF_RF5_SIZE                           equ 0001h
PORTF_RF5_LENGTH                         equ 0001h
PORTF_RF5_MASK                           equ 0020h
PORTF_RF6_POSN                           equ 0006h
PORTF_RF6_POSITION                       equ 0006h
PORTF_RF6_SIZE                           equ 0001h
PORTF_RF6_LENGTH                         equ 0001h
PORTF_RF6_MASK                           equ 0040h
PORTF_RF7_POSN                           equ 0007h
PORTF_RF7_POSITION                       equ 0007h
PORTF_RF7_SIZE                           equ 0001h
PORTF_RF7_LENGTH                         equ 0001h
PORTF_RF7_MASK                           equ 0080h
PORTF_AN7_POSN                           equ 0002h
PORTF_AN7_POSITION                       equ 0002h
PORTF_AN7_SIZE                           equ 0001h
PORTF_AN7_LENGTH                         equ 0001h
PORTF_AN7_MASK                           equ 0004h
PORTF_AN10_POSN                          equ 0005h
PORTF_AN10_POSITION                      equ 0005h
PORTF_AN10_SIZE                          equ 0001h
PORTF_AN10_LENGTH                        equ 0001h
PORTF_AN10_MASK                          equ 0020h
PORTF_AN11_POSN                          equ 0006h
PORTF_AN11_POSITION                      equ 0006h
PORTF_AN11_SIZE                          equ 0001h
PORTF_AN11_LENGTH                        equ 0001h
PORTF_AN11_MASK                          equ 0040h
PORTF_SS_POSN                            equ 0007h
PORTF_SS_POSITION                        equ 0007h
PORTF_SS_SIZE                            equ 0001h
PORTF_SS_LENGTH                          equ 0001h
PORTF_SS_MASK                            equ 0080h
PORTF_CVREF_POSN                         equ 0005h
PORTF_CVREF_POSITION                     equ 0005h
PORTF_CVREF_SIZE                         equ 0001h
PORTF_CVREF_LENGTH                       equ 0001h
PORTF_CVREF_MASK                         equ 0020h
PORTF_C2INB_POSN                         equ 0002h
PORTF_C2INB_POSITION                     equ 0002h
PORTF_C2INB_SIZE                         equ 0001h
PORTF_C2INB_LENGTH                       equ 0001h
PORTF_C2INB_MASK                         equ 0004h
PORTF_C1INB_POSN                         equ 0005h
PORTF_C1INB_POSITION                     equ 0005h
PORTF_C1INB_SIZE                         equ 0001h
PORTF_C1INB_LENGTH                       equ 0001h
PORTF_C1INB_MASK                         equ 0020h
PORTF_C1INA_POSN                         equ 0006h
PORTF_C1INA_POSITION                     equ 0006h
PORTF_C1INA_SIZE                         equ 0001h
PORTF_C1INA_LENGTH                       equ 0001h
PORTF_C1INA_MASK                         equ 0040h
PORTF_C1OUT_POSN                         equ 0007h
PORTF_C1OUT_POSITION                     equ 0007h
PORTF_C1OUT_SIZE                         equ 0001h
PORTF_C1OUT_LENGTH                       equ 0001h
PORTF_C1OUT_MASK                         equ 0080h
PORTF_PMA5_POSN                          equ 0002h
PORTF_PMA5_POSITION                      equ 0002h
PORTF_PMA5_SIZE                          equ 0001h
PORTF_PMA5_LENGTH                        equ 0001h
PORTF_PMA5_MASK                          equ 0004h
PORTF_PMD2_POSN                          equ 0005h
PORTF_PMD2_POSITION                      equ 0005h
PORTF_PMD2_SIZE                          equ 0001h
PORTF_PMD2_LENGTH                        equ 0001h
PORTF_PMD2_MASK                          equ 0020h
PORTF_PMD1_POSN                          equ 0006h
PORTF_PMD1_POSITION                      equ 0006h
PORTF_PMD1_SIZE                          equ 0001h
PORTF_PMD1_LENGTH                        equ 0001h
PORTF_PMD1_MASK                          equ 0040h
PORTF_PMD0_POSN                          equ 0007h
PORTF_PMD0_POSITION                      equ 0007h
PORTF_PMD0_SIZE                          equ 0001h
PORTF_PMD0_LENGTH                        equ 0001h
PORTF_PMD0_MASK                          equ 0080h
PORTF_C1OUTF_POSN                        equ 0002h
PORTF_C1OUTF_POSITION                    equ 0002h
PORTF_C1OUTF_SIZE                        equ 0001h
PORTF_C1OUTF_LENGTH                      equ 0001h
PORTF_C1OUTF_MASK                        equ 0004h

// Register: PORTG
#define PORTG PORTG
PORTG                                    equ 0F86h
// bitfield definitions
PORTG_RG0_POSN                           equ 0000h
PORTG_RG0_POSITION                       equ 0000h
PORTG_RG0_SIZE                           equ 0001h
PORTG_RG0_LENGTH                         equ 0001h
PORTG_RG0_MASK                           equ 0001h
PORTG_RG1_POSN                           equ 0001h
PORTG_RG1_POSITION                       equ 0001h
PORTG_RG1_SIZE                           equ 0001h
PORTG_RG1_LENGTH                         equ 0001h
PORTG_RG1_MASK                           equ 0002h
PORTG_RG2_POSN                           equ 0002h
PORTG_RG2_POSITION                       equ 0002h
PORTG_RG2_SIZE                           equ 0001h
PORTG_RG2_LENGTH                         equ 0001h
PORTG_RG2_MASK                           equ 0004h
PORTG_RG3_POSN                           equ 0003h
PORTG_RG3_POSITION                       equ 0003h
PORTG_RG3_SIZE                           equ 0001h
PORTG_RG3_LENGTH                         equ 0001h
PORTG_RG3_MASK                           equ 0008h
PORTG_RG4_POSN                           equ 0004h
PORTG_RG4_POSITION                       equ 0004h
PORTG_RG4_SIZE                           equ 0001h
PORTG_RG4_LENGTH                         equ 0001h
PORTG_RG4_MASK                           equ 0010h
PORTG_RJPU_POSN                          equ 0005h
PORTG_RJPU_POSITION                      equ 0005h
PORTG_RJPU_SIZE                          equ 0001h
PORTG_RJPU_LENGTH                        equ 0001h
PORTG_RJPU_MASK                          equ 0020h
PORTG_REPU_POSN                          equ 0006h
PORTG_REPU_POSITION                      equ 0006h
PORTG_REPU_SIZE                          equ 0001h
PORTG_REPU_LENGTH                        equ 0001h
PORTG_REPU_MASK                          equ 0040h
PORTG_RDPU_POSN                          equ 0007h
PORTG_RDPU_POSITION                      equ 0007h
PORTG_RDPU_SIZE                          equ 0001h
PORTG_RDPU_LENGTH                        equ 0001h
PORTG_RDPU_MASK                          equ 0080h
PORTG_CCP3_POSN                          equ 0000h
PORTG_CCP3_POSITION                      equ 0000h
PORTG_CCP3_SIZE                          equ 0001h
PORTG_CCP3_LENGTH                        equ 0001h
PORTG_CCP3_MASK                          equ 0001h
PORTG_TX2_POSN                           equ 0001h
PORTG_TX2_POSITION                       equ 0001h
PORTG_TX2_SIZE                           equ 0001h
PORTG_TX2_LENGTH                         equ 0001h
PORTG_TX2_MASK                           equ 0002h
PORTG_RX2_POSN                           equ 0002h
PORTG_RX2_POSITION                       equ 0002h
PORTG_RX2_SIZE                           equ 0001h
PORTG_RX2_LENGTH                         equ 0001h
PORTG_RX2_MASK                           equ 0004h
PORTG_CCP4_POSN                          equ 0003h
PORTG_CCP4_POSITION                      equ 0003h
PORTG_CCP4_SIZE                          equ 0001h
PORTG_CCP4_LENGTH                        equ 0001h
PORTG_CCP4_MASK                          equ 0008h
PORTG_CCP5_POSN                          equ 0004h
PORTG_CCP5_POSITION                      equ 0004h
PORTG_CCP5_SIZE                          equ 0001h
PORTG_CCP5_LENGTH                        equ 0001h
PORTG_CCP5_MASK                          equ 0010h
PORTG_CK2_POSN                           equ 0001h
PORTG_CK2_POSITION                       equ 0001h
PORTG_CK2_SIZE                           equ 0001h
PORTG_CK2_LENGTH                         equ 0001h
PORTG_CK2_MASK                           equ 0002h
PORTG_DT2_POSN                           equ 0002h
PORTG_DT2_POSITION                       equ 0002h
PORTG_DT2_SIZE                           equ 0001h
PORTG_DT2_LENGTH                         equ 0001h
PORTG_DT2_MASK                           equ 0004h
PORTG_PMA8_POSN                          equ 0000h
PORTG_PMA8_POSITION                      equ 0000h
PORTG_PMA8_SIZE                          equ 0001h
PORTG_PMA8_LENGTH                        equ 0001h
PORTG_PMA8_MASK                          equ 0001h
PORTG_PMA7_POSN                          equ 0001h
PORTG_PMA7_POSITION                      equ 0001h
PORTG_PMA7_SIZE                          equ 0001h
PORTG_PMA7_LENGTH                        equ 0001h
PORTG_PMA7_MASK                          equ 0002h
PORTG_PMA6_POSN                          equ 0002h
PORTG_PMA6_POSITION                      equ 0002h
PORTG_PMA6_SIZE                          equ 0001h
PORTG_PMA6_LENGTH                        equ 0001h
PORTG_PMA6_MASK                          equ 0004h
PORTG_PMCS1_POSN                         equ 0003h
PORTG_PMCS1_POSITION                     equ 0003h
PORTG_PMCS1_SIZE                         equ 0001h
PORTG_PMCS1_LENGTH                       equ 0001h
PORTG_PMCS1_MASK                         equ 0008h
PORTG_PMCS2_POSN                         equ 0004h
PORTG_PMCS2_POSITION                     equ 0004h
PORTG_PMCS2_SIZE                         equ 0001h
PORTG_PMCS2_LENGTH                       equ 0001h
PORTG_PMCS2_MASK                         equ 0010h
PORTG_C3OUTG_POSN                        equ 0001h
PORTG_C3OUTG_POSITION                    equ 0001h
PORTG_C3OUTG_SIZE                        equ 0001h
PORTG_C3OUTG_LENGTH                      equ 0001h
PORTG_C3OUTG_MASK                        equ 0002h
PORTG_RG5_POSN                           equ 0005h
PORTG_RG5_POSITION                       equ 0005h
PORTG_RG5_SIZE                           equ 0001h
PORTG_RG5_LENGTH                         equ 0001h
PORTG_RG5_MASK                           equ 0020h
PORTG_RG6_POSN                           equ 0006h
PORTG_RG6_POSITION                       equ 0006h
PORTG_RG6_SIZE                           equ 0001h
PORTG_RG6_LENGTH                         equ 0001h
PORTG_RG6_MASK                           equ 0040h
PORTG_RG7_POSN                           equ 0007h
PORTG_RG7_POSITION                       equ 0007h
PORTG_RG7_SIZE                           equ 0001h
PORTG_RG7_LENGTH                         equ 0001h
PORTG_RG7_MASK                           equ 0080h

// Register: PORTH
#define PORTH PORTH
PORTH                                    equ 0F87h
// bitfield definitions
PORTH_RH0_POSN                           equ 0000h
PORTH_RH0_POSITION                       equ 0000h
PORTH_RH0_SIZE                           equ 0001h
PORTH_RH0_LENGTH                         equ 0001h
PORTH_RH0_MASK                           equ 0001h
PORTH_RH1_POSN                           equ 0001h
PORTH_RH1_POSITION                       equ 0001h
PORTH_RH1_SIZE                           equ 0001h
PORTH_RH1_LENGTH                         equ 0001h
PORTH_RH1_MASK                           equ 0002h
PORTH_RH2_POSN                           equ 0002h
PORTH_RH2_POSITION                       equ 0002h
PORTH_RH2_SIZE                           equ 0001h
PORTH_RH2_LENGTH                         equ 0001h
PORTH_RH2_MASK                           equ 0004h
PORTH_RH3_POSN                           equ 0003h
PORTH_RH3_POSITION                       equ 0003h
PORTH_RH3_SIZE                           equ 0001h
PORTH_RH3_LENGTH                         equ 0001h
PORTH_RH3_MASK                           equ 0008h
PORTH_RH4_POSN                           equ 0004h
PORTH_RH4_POSITION                       equ 0004h
PORTH_RH4_SIZE                           equ 0001h
PORTH_RH4_LENGTH                         equ 0001h
PORTH_RH4_MASK                           equ 0010h
PORTH_RH5_POSN                           equ 0005h
PORTH_RH5_POSITION                       equ 0005h
PORTH_RH5_SIZE                           equ 0001h
PORTH_RH5_LENGTH                         equ 0001h
PORTH_RH5_MASK                           equ 0020h
PORTH_RH6_POSN                           equ 0006h
PORTH_RH6_POSITION                       equ 0006h
PORTH_RH6_SIZE                           equ 0001h
PORTH_RH6_LENGTH                         equ 0001h
PORTH_RH6_MASK                           equ 0040h
PORTH_RH7_POSN                           equ 0007h
PORTH_RH7_POSITION                       equ 0007h
PORTH_RH7_SIZE                           equ 0001h
PORTH_RH7_LENGTH                         equ 0001h
PORTH_RH7_MASK                           equ 0080h
PORTH_A16_POSN                           equ 0000h
PORTH_A16_POSITION                       equ 0000h
PORTH_A16_SIZE                           equ 0001h
PORTH_A16_LENGTH                         equ 0001h
PORTH_A16_MASK                           equ 0001h
PORTH_A17_POSN                           equ 0001h
PORTH_A17_POSITION                       equ 0001h
PORTH_A17_SIZE                           equ 0001h
PORTH_A17_LENGTH                         equ 0001h
PORTH_A17_MASK                           equ 0002h
PORTH_A18_POSN                           equ 0002h
PORTH_A18_POSITION                       equ 0002h
PORTH_A18_SIZE                           equ 0001h
PORTH_A18_LENGTH                         equ 0001h
PORTH_A18_MASK                           equ 0004h
PORTH_A19_POSN                           equ 0003h
PORTH_A19_POSITION                       equ 0003h
PORTH_A19_SIZE                           equ 0001h
PORTH_A19_LENGTH                         equ 0001h
PORTH_A19_MASK                           equ 0008h
PORTH_AN12_POSN                          equ 0004h
PORTH_AN12_POSITION                      equ 0004h
PORTH_AN12_SIZE                          equ 0001h
PORTH_AN12_LENGTH                        equ 0001h
PORTH_AN12_MASK                          equ 0010h
PORTH_AN13_POSN                          equ 0005h
PORTH_AN13_POSITION                      equ 0005h
PORTH_AN13_SIZE                          equ 0001h
PORTH_AN13_LENGTH                        equ 0001h
PORTH_AN13_MASK                          equ 0020h
PORTH_AN14_POSN                          equ 0006h
PORTH_AN14_POSITION                      equ 0006h
PORTH_AN14_SIZE                          equ 0001h
PORTH_AN14_LENGTH                        equ 0001h
PORTH_AN14_MASK                          equ 0040h
PORTH_AN15_POSN                          equ 0007h
PORTH_AN15_POSITION                      equ 0007h
PORTH_AN15_SIZE                          equ 0001h
PORTH_AN15_LENGTH                        equ 0001h
PORTH_AN15_MASK                          equ 0080h
PORTH_PMD7_POSN                          equ 0002h
PORTH_PMD7_POSITION                      equ 0002h
PORTH_PMD7_SIZE                          equ 0001h
PORTH_PMD7_LENGTH                        equ 0001h
PORTH_PMD7_MASK                          equ 0004h
PORTH_PMD6_POSN                          equ 0003h
PORTH_PMD6_POSITION                      equ 0003h
PORTH_PMD6_SIZE                          equ 0001h
PORTH_PMD6_LENGTH                        equ 0001h
PORTH_PMD6_MASK                          equ 0008h
PORTH_PMD3_POSN                          equ 0004h
PORTH_PMD3_POSITION                      equ 0004h
PORTH_PMD3_SIZE                          equ 0001h
PORTH_PMD3_LENGTH                        equ 0001h
PORTH_PMD3_MASK                          equ 0010h
PORTH_PMBE_POSN                          equ 0005h
PORTH_PMBE_POSITION                      equ 0005h
PORTH_PMBE_SIZE                          equ 0001h
PORTH_PMBE_LENGTH                        equ 0001h
PORTH_PMBE_MASK                          equ 0020h
PORTH_PMRD_POSN                          equ 0006h
PORTH_PMRD_POSITION                      equ 0006h
PORTH_PMRD_SIZE                          equ 0001h
PORTH_PMRD_LENGTH                        equ 0001h
PORTH_PMRD_MASK                          equ 0040h
PORTH_PMWR_POSN                          equ 0007h
PORTH_PMWR_POSITION                      equ 0007h
PORTH_PMWR_SIZE                          equ 0001h
PORTH_PMWR_LENGTH                        equ 0001h
PORTH_PMWR_MASK                          equ 0080h
PORTH_C2INC_POSN                         equ 0004h
PORTH_C2INC_POSITION                     equ 0004h
PORTH_C2INC_SIZE                         equ 0001h
PORTH_C2INC_LENGTH                       equ 0001h
PORTH_C2INC_MASK                         equ 0010h
PORTH_C2IND_POSN                         equ 0005h
PORTH_C2IND_POSITION                     equ 0005h
PORTH_C2IND_SIZE                         equ 0001h
PORTH_C2IND_LENGTH                       equ 0001h
PORTH_C2IND_MASK                         equ 0020h
PORTH_C1INC_POSN                         equ 0006h
PORTH_C1INC_POSITION                     equ 0006h
PORTH_C1INC_SIZE                         equ 0001h
PORTH_C1INC_LENGTH                       equ 0001h
PORTH_C1INC_MASK                         equ 0040h
PORTH_CCP9_POSN                          equ 0004h
PORTH_CCP9_POSITION                      equ 0004h
PORTH_CCP9_SIZE                          equ 0001h
PORTH_CCP9_LENGTH                        equ 0001h
PORTH_CCP9_MASK                          equ 0010h
PORTH_CCP8_POSN                          equ 0005h
PORTH_CCP8_POSITION                      equ 0005h
PORTH_CCP8_SIZE                          equ 0001h
PORTH_CCP8_LENGTH                        equ 0001h
PORTH_CCP8_MASK                          equ 0020h
PORTH_CCP7_POSN                          equ 0006h
PORTH_CCP7_POSITION                      equ 0006h
PORTH_CCP7_SIZE                          equ 0001h
PORTH_CCP7_LENGTH                        equ 0001h
PORTH_CCP7_MASK                          equ 0040h
PORTH_CCP6_POSN                          equ 0007h
PORTH_CCP6_POSITION                      equ 0007h
PORTH_CCP6_SIZE                          equ 0001h
PORTH_CCP6_LENGTH                        equ 0001h
PORTH_CCP6_MASK                          equ 0080h
PORTH_PC3_POSN                           equ 0004h
PORTH_PC3_POSITION                       equ 0004h
PORTH_PC3_SIZE                           equ 0001h
PORTH_PC3_LENGTH                         equ 0001h
PORTH_PC3_MASK                           equ 0010h
PORTH_PB3_POSN                           equ 0005h
PORTH_PB3_POSITION                       equ 0005h
PORTH_PB3_SIZE                           equ 0001h
PORTH_PB3_LENGTH                         equ 0001h
PORTH_PB3_MASK                           equ 0020h
PORTH_PC1_POSN                           equ 0006h
PORTH_PC1_POSITION                       equ 0006h
PORTH_PC1_SIZE                           equ 0001h
PORTH_PC1_LENGTH                         equ 0001h
PORTH_PC1_MASK                           equ 0040h
PORTH_PB1_POSN                           equ 0007h
PORTH_PB1_POSITION                       equ 0007h
PORTH_PB1_SIZE                           equ 0001h
PORTH_PB1_LENGTH                         equ 0001h
PORTH_PB1_MASK                           equ 0080h

