GopalSaraf/Practicals/PSDL/include/proc/pic18f85j50.inc
// Register: TRISF
#define TRISF TRISF
TRISF                                    equ 0F97h
// bitfield definitions
TRISF_TRISF2_POSN                        equ 0002h
TRISF_TRISF2_POSITION                    equ 0002h
TRISF_TRISF2_SIZE                        equ 0001h
TRISF_TRISF2_LENGTH                      equ 0001h
TRISF_TRISF2_MASK                        equ 0004h
TRISF_TRISF3_POSN                        equ 0003h
TRISF_TRISF3_POSITION                    equ 0003h
TRISF_TRISF3_SIZE                        equ 0001h
TRISF_TRISF3_LENGTH                      equ 0001h
TRISF_TRISF3_MASK                        equ 0008h
TRISF_TRISF4_POSN                        equ 0004h
TRISF_TRISF4_POSITION                    equ 0004h
TRISF_TRISF4_SIZE                        equ 0001h
TRISF_TRISF4_LENGTH                      equ 0001h
TRISF_TRISF4_MASK                        equ 0010h
TRISF_TRISF5_POSN                        equ 0005h
TRISF_TRISF5_POSITION                    equ 0005h
TRISF_TRISF5_SIZE                        equ 0001h
TRISF_TRISF5_LENGTH                      equ 0001h
TRISF_TRISF5_MASK                        equ 0020h
TRISF_TRISF6_POSN                        equ 0006h
TRISF_TRISF6_POSITION                    equ 0006h
TRISF_TRISF6_SIZE                        equ 0001h
TRISF_TRISF6_LENGTH                      equ 0001h
TRISF_TRISF6_MASK                        equ 0040h
TRISF_TRISF7_POSN                        equ 0007h
TRISF_TRISF7_POSITION                    equ 0007h
TRISF_TRISF7_SIZE                        equ 0001h
TRISF_TRISF7_LENGTH                      equ 0001h
TRISF_TRISF7_MASK                        equ 0080h
TRISF_RF2_POSN                           equ 0002h
TRISF_RF2_POSITION                       equ 0002h
TRISF_RF2_SIZE                           equ 0001h
TRISF_RF2_LENGTH                         equ 0001h
TRISF_RF2_MASK                           equ 0004h
TRISF_RF3_POSN                           equ 0003h
TRISF_RF3_POSITION                       equ 0003h
TRISF_RF3_SIZE                           equ 0001h
TRISF_RF3_LENGTH                         equ 0001h
TRISF_RF3_MASK                           equ 0008h
TRISF_RF4_POSN                           equ 0004h
TRISF_RF4_POSITION                       equ 0004h
TRISF_RF4_SIZE                           equ 0001h
TRISF_RF4_LENGTH                         equ 0001h
TRISF_RF4_MASK                           equ 0010h
TRISF_RF5_POSN                           equ 0005h
TRISF_RF5_POSITION                       equ 0005h
TRISF_RF5_SIZE                           equ 0001h
TRISF_RF5_LENGTH                         equ 0001h
TRISF_RF5_MASK                           equ 0020h
TRISF_RF6_POSN                           equ 0006h
TRISF_RF6_POSITION                       equ 0006h
TRISF_RF6_SIZE                           equ 0001h
TRISF_RF6_LENGTH                         equ 0001h
TRISF_RF6_MASK                           equ 0040h
TRISF_RF7_POSN                           equ 0007h
TRISF_RF7_POSITION                       equ 0007h
TRISF_RF7_SIZE                           equ 0001h
TRISF_RF7_LENGTH                         equ 0001h
TRISF_RF7_MASK                           equ 0080h

// Register: TRISG
#define TRISG TRISG
TRISG                                    equ 0F98h
// bitfield definitions
TRISG_TRISG0_POSN                        equ 0000h
TRISG_TRISG0_POSITION                    equ 0000h
TRISG_TRISG0_SIZE                        equ 0001h
TRISG_TRISG0_LENGTH                      equ 0001h
TRISG_TRISG0_MASK                        equ 0001h
TRISG_TRISG1_POSN                        equ 0001h
TRISG_TRISG1_POSITION                    equ 0001h
TRISG_TRISG1_SIZE                        equ 0001h
TRISG_TRISG1_LENGTH                      equ 0001h
TRISG_TRISG1_MASK                        equ 0002h
TRISG_TRISG2_POSN                        equ 0002h
TRISG_TRISG2_POSITION                    equ 0002h
TRISG_TRISG2_SIZE                        equ 0001h
TRISG_TRISG2_LENGTH                      equ 0001h
TRISG_TRISG2_MASK                        equ 0004h
TRISG_TRISG3_POSN                        equ 0003h
TRISG_TRISG3_POSITION                    equ 0003h
TRISG_TRISG3_SIZE                        equ 0001h
TRISG_TRISG3_LENGTH                      equ 0001h
TRISG_TRISG3_MASK                        equ 0008h
TRISG_TRISG4_POSN                        equ 0004h
TRISG_TRISG4_POSITION                    equ 0004h
TRISG_TRISG4_SIZE                        equ 0001h
TRISG_TRISG4_LENGTH                      equ 0001h
TRISG_TRISG4_MASK                        equ 0010h
TRISG_RG0_POSN                           equ 0000h
TRISG_RG0_POSITION                       equ 0000h
TRISG_RG0_SIZE                           equ 0001h
TRISG_RG0_LENGTH                         equ 0001h
TRISG_RG0_MASK                           equ 0001h
TRISG_RG1_POSN                           equ 0001h
TRISG_RG1_POSITION                       equ 0001h
TRISG_RG1_SIZE                           equ 0001h
TRISG_RG1_LENGTH                         equ 0001h
TRISG_RG1_MASK                           equ 0002h
TRISG_RG2_POSN                           equ 0002h
TRISG_RG2_POSITION                       equ 0002h
TRISG_RG2_SIZE                           equ 0001h
TRISG_RG2_LENGTH                         equ 0001h
TRISG_RG2_MASK                           equ 0004h
TRISG_RG3_POSN                           equ 0003h
TRISG_RG3_POSITION                       equ 0003h
TRISG_RG3_SIZE                           equ 0001h
TRISG_RG3_LENGTH                         equ 0001h
TRISG_RG3_MASK                           equ 0008h
TRISG_RG4_POSN                           equ 0004h
TRISG_RG4_POSITION                       equ 0004h
TRISG_RG4_SIZE                           equ 0001h
TRISG_RG4_LENGTH                         equ 0001h
TRISG_RG4_MASK                           equ 0010h

// Register: TRISH
#define TRISH TRISH
TRISH                                    equ 0F99h
// bitfield definitions
TRISH_TRISH0_POSN                        equ 0000h
TRISH_TRISH0_POSITION                    equ 0000h
TRISH_TRISH0_SIZE                        equ 0001h
TRISH_TRISH0_LENGTH                      equ 0001h
TRISH_TRISH0_MASK                        equ 0001h
TRISH_TRISH1_POSN                        equ 0001h
TRISH_TRISH1_POSITION                    equ 0001h
TRISH_TRISH1_SIZE                        equ 0001h
TRISH_TRISH1_LENGTH                      equ 0001h
TRISH_TRISH1_MASK                        equ 0002h
TRISH_TRISH2_POSN                        equ 0002h
TRISH_TRISH2_POSITION                    equ 0002h
TRISH_TRISH2_SIZE                        equ 0001h
TRISH_TRISH2_LENGTH                      equ 0001h
TRISH_TRISH2_MASK                        equ 0004h
TRISH_TRISH3_POSN                        equ 0003h
TRISH_TRISH3_POSITION                    equ 0003h
TRISH_TRISH3_SIZE                        equ 0001h
TRISH_TRISH3_LENGTH                      equ 0001h
TRISH_TRISH3_MASK                        equ 0008h
TRISH_TRISH4_POSN                        equ 0004h
TRISH_TRISH4_POSITION                    equ 0004h
TRISH_TRISH4_SIZE                        equ 0001h
TRISH_TRISH4_LENGTH                      equ 0001h
TRISH_TRISH4_MASK                        equ 0010h
TRISH_TRISH5_POSN                        equ 0005h
TRISH_TRISH5_POSITION                    equ 0005h
TRISH_TRISH5_SIZE                        equ 0001h
TRISH_TRISH5_LENGTH                      equ 0001h
TRISH_TRISH5_MASK                        equ 0020h
TRISH_TRISH6_POSN                        equ 0006h
TRISH_TRISH6_POSITION                    equ 0006h
TRISH_TRISH6_SIZE                        equ 0001h
TRISH_TRISH6_LENGTH                      equ 0001h
TRISH_TRISH6_MASK                        equ 0040h
TRISH_TRISH7_POSN                        equ 0007h
TRISH_TRISH7_POSITION                    equ 0007h
TRISH_TRISH7_SIZE                        equ 0001h
TRISH_TRISH7_LENGTH                      equ 0001h
TRISH_TRISH7_MASK                        equ 0080h
TRISH_RH0_POSN                           equ 0000h
TRISH_RH0_POSITION                       equ 0000h
TRISH_RH0_SIZE                           equ 0001h
TRISH_RH0_LENGTH                         equ 0001h
TRISH_RH0_MASK                           equ 0001h
TRISH_RH1_POSN                           equ 0001h
TRISH_RH1_POSITION                       equ 0001h
TRISH_RH1_SIZE                           equ 0001h
TRISH_RH1_LENGTH                         equ 0001h
TRISH_RH1_MASK                           equ 0002h
TRISH_RH2_POSN                           equ 0002h
TRISH_RH2_POSITION                       equ 0002h
TRISH_RH2_SIZE                           equ 0001h
TRISH_RH2_LENGTH                         equ 0001h
TRISH_RH2_MASK                           equ 0004h
TRISH_RH3_POSN                           equ 0003h
TRISH_RH3_POSITION                       equ 0003h
TRISH_RH3_SIZE                           equ 0001h
TRISH_RH3_LENGTH                         equ 0001h
TRISH_RH3_MASK                           equ 0008h
TRISH_RH4_POSN                           equ 0004h
TRISH_RH4_POSITION                       equ 0004h
TRISH_RH4_SIZE                           equ 0001h
TRISH_RH4_LENGTH                         equ 0001h
TRISH_RH4_MASK                           equ 0010h
TRISH_RH5_POSN                           equ 0005h
TRISH_RH5_POSITION                       equ 0005h
TRISH_RH5_SIZE                           equ 0001h
TRISH_RH5_LENGTH                         equ 0001h
TRISH_RH5_MASK                           equ 0020h
TRISH_RH6_POSN                           equ 0006h
TRISH_RH6_POSITION                       equ 0006h
TRISH_RH6_SIZE                           equ 0001h
TRISH_RH6_LENGTH                         equ 0001h
TRISH_RH6_MASK                           equ 0040h
TRISH_RH7_POSN                           equ 0007h
TRISH_RH7_POSITION                       equ 0007h
TRISH_RH7_SIZE                           equ 0001h
TRISH_RH7_LENGTH                         equ 0001h
TRISH_RH7_MASK                           equ 0080h

// Register: TRISJ
#define TRISJ TRISJ
TRISJ                                    equ 0F9Ah
// bitfield definitions
TRISJ_TRISJ0_POSN                        equ 0000h
TRISJ_TRISJ0_POSITION                    equ 0000h
TRISJ_TRISJ0_SIZE                        equ 0001h
TRISJ_TRISJ0_LENGTH                      equ 0001h
TRISJ_TRISJ0_MASK                        equ 0001h
TRISJ_TRISJ1_POSN                        equ 0001h
TRISJ_TRISJ1_POSITION                    equ 0001h
TRISJ_TRISJ1_SIZE                        equ 0001h
TRISJ_TRISJ1_LENGTH                      equ 0001h
TRISJ_TRISJ1_MASK                        equ 0002h
TRISJ_TRISJ2_POSN                        equ 0002h
TRISJ_TRISJ2_POSITION                    equ 0002h
TRISJ_TRISJ2_SIZE                        equ 0001h
TRISJ_TRISJ2_LENGTH                      equ 0001h
TRISJ_TRISJ2_MASK                        equ 0004h
TRISJ_TRISJ3_POSN                        equ 0003h
TRISJ_TRISJ3_POSITION                    equ 0003h
TRISJ_TRISJ3_SIZE                        equ 0001h
TRISJ_TRISJ3_LENGTH                      equ 0001h
TRISJ_TRISJ3_MASK                        equ 0008h
TRISJ_TRISJ4_POSN                        equ 0004h
TRISJ_TRISJ4_POSITION                    equ 0004h
TRISJ_TRISJ4_SIZE                        equ 0001h
TRISJ_TRISJ4_LENGTH                      equ 0001h
TRISJ_TRISJ4_MASK                        equ 0010h
TRISJ_TRISJ5_POSN                        equ 0005h
TRISJ_TRISJ5_POSITION                    equ 0005h
TRISJ_TRISJ5_SIZE                        equ 0001h
TRISJ_TRISJ5_LENGTH                      equ 0001h
TRISJ_TRISJ5_MASK                        equ 0020h
TRISJ_TRISJ6_POSN                        equ 0006h
TRISJ_TRISJ6_POSITION                    equ 0006h
TRISJ_TRISJ6_SIZE                        equ 0001h
TRISJ_TRISJ6_LENGTH                      equ 0001h
TRISJ_TRISJ6_MASK                        equ 0040h
TRISJ_TRISJ7_POSN                        equ 0007h
TRISJ_TRISJ7_POSITION                    equ 0007h
TRISJ_TRISJ7_SIZE                        equ 0001h
TRISJ_TRISJ7_LENGTH                      equ 0001h
TRISJ_TRISJ7_MASK                        equ 0080h
TRISJ_RJ0_POSN                           equ 0000h
TRISJ_RJ0_POSITION                       equ 0000h
TRISJ_RJ0_SIZE                           equ 0001h
TRISJ_RJ0_LENGTH                         equ 0001h
TRISJ_RJ0_MASK                           equ 0001h
TRISJ_RJ1_POSN                           equ 0001h
TRISJ_RJ1_POSITION                       equ 0001h
TRISJ_RJ1_SIZE                           equ 0001h
TRISJ_RJ1_LENGTH                         equ 0001h
TRISJ_RJ1_MASK                           equ 0002h
TRISJ_RJ2_POSN                           equ 0002h
TRISJ_RJ2_POSITION                       equ 0002h
TRISJ_RJ2_SIZE                           equ 0001h
TRISJ_RJ2_LENGTH                         equ 0001h
TRISJ_RJ2_MASK                           equ 0004h
TRISJ_RJ3_POSN                           equ 0003h
TRISJ_RJ3_POSITION                       equ 0003h
TRISJ_RJ3_SIZE                           equ 0001h
TRISJ_RJ3_LENGTH                         equ 0001h
TRISJ_RJ3_MASK                           equ 0008h
TRISJ_RJ4_POSN                           equ 0004h
TRISJ_RJ4_POSITION                       equ 0004h
TRISJ_RJ4_SIZE                           equ 0001h
TRISJ_RJ4_LENGTH                         equ 0001h
TRISJ_RJ4_MASK                           equ 0010h
TRISJ_RJ5_POSN                           equ 0005h
TRISJ_RJ5_POSITION                       equ 0005h
TRISJ_RJ5_SIZE                           equ 0001h
TRISJ_RJ5_LENGTH                         equ 0001h
TRISJ_RJ5_MASK                           equ 0020h
TRISJ_RJ6_POSN                           equ 0006h
TRISJ_RJ6_POSITION                       equ 0006h
TRISJ_RJ6_SIZE                           equ 0001h
TRISJ_RJ6_LENGTH                         equ 0001h
TRISJ_RJ6_MASK                           equ 0040h
TRISJ_RJ7_POSN                           equ 0007h
TRISJ_RJ7_POSITION                       equ 0007h
TRISJ_RJ7_SIZE                           equ 0001h
TRISJ_RJ7_LENGTH                         equ 0001h
TRISJ_RJ7_MASK                           equ 0080h

